tap "caryll/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "universal-ctags/universal-ctags"
tap "getantibody/tap"
brew "autoconf"
brew "automake"
brew "gettext", link: false
brew "openssl"
brew "readline"
brew "sqlite"
brew "python"
brew "cmake"
brew "coreutils"
brew "curl"
brew "fzf"
brew "git"
brew "gnupg"
brew "htop"
brew "jq"
brew "libidn"
brew "libmikmod"
brew "libpq"
brew "postgresql", restart_service: true, link: true
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby"
brew "stow"
brew "tmux"
brew "vim"
brew "wget"
brew "zlib"
brew "getantibody/tap/antibody"
brew "zsh"
brew "jesseduffield/lazygit/lazygit"
brew "httpie"
brew "bat"
brew "nnn"
brew 'mas' # Mac App Store manager

cask "fliqlo"

# fonts
cask "font-consolas-for-powerline"
cask "font-cascadia"
cask "font-ubuntu"
cask "font-fira-code"
# other
cask "brave-browser"
cask "spotify"
cask "visual-studio-code"
cask "rambox"
cask "slack"
cask "iterm2"
cask "zoomus"
#apple store
mas 'Todoist', id: 585829637
